using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Collections;

namespace EBMSMap30
{
    public class DefCL
    {
        Hashtable defSet = new Hashtable();
        public Hashtable DefSet
        {
            get { return defSet; }
        }
        public DefCL()
        {


            defSet.Add("SMPK:RAIN_VOL",
                new string[]{
                    "#6666FF","1,000-1,200 มม.","",
                    "#FFFF66","1,200-1,400 มม.","",
                    "#66FF66","1,400-1,600 มม.","",
                    "!","กรมอุตุนิยมวิทยา",""
                });
            defSet.Add("SMPK:TEMP_AVG",
                new string[]{
                    "#FF9966","32-34 C","",
                    "!","กรมอุตุนิยมวิทยา",""
                    });
            defSet.Add("SMPK:COAST_GEOMOR",
               new string[]{
                    "#FF9900","ที่ราบใต้ระดับน้ำลง","",
                    "#FFFF00","หาดทรายปัจจุบัน","",
                    "#FF0000","ที่ราบน้ำขึ้นถึง","",
                    "#00FF00","พื้นที่แปรสภาพ","",
                    "#0000FF","ที่ราบน้ำขึ้นถึงเดิม","",
                    "!","กรมทรัพยากรธรณี",""
                });
            defSet.Add("SMPK:GEOLOGY",
               new string[]{
                    "#666633","Jurassic","",
                    "!","กรมทรัพยากรธรณี",""
                    });
            defSet.Add("SMPK:LU2554",
              new string[]{
                    "#9BBB59","พื้นที่นา","A1",
                    "#C2D69B","พื้นที่ปลูกไม้ยืนต้น","A3,A4,A5",
                    "#7030A0","พื้นที่โรงเรือนเลี้ยงสัตว์","A7",
                    "#F79646","พื้นที่เพาะเลี้ยงน้ำ","A8,A9",
                    "#00B050","พื้นที่ป่าไม้","F3,M1",
                    "#FF3399","พื้นที่ลุ่ม/นาเกลือ","M2,M3,M4",
                    "#FFFF00","พื้นที่ชุมชน","U1,U2",
                    "#FF0000","พื้นที่อุตสาหกรรม","U3,U5",
                    "#0070C0","พื้นที่สนามบิน/ท่าเรือ","U4",
                    "#C00000","สถานที่พักผ่อน/สนามกอล์ฟ","U6",
                    "#4BACC6","พื้นที่น้ำ","W",
                    "!","กรมโยธาธิการและผังเมือง",""
                });
            defSet.Add("SMPK:LU2545",
              new string[]{
                    "#9BBB59","พื้นที่นา","A1",
                    "#C2D69B","พื้นที่ปลูกไม้ยืนต้น","A3,A4,A5",
                    "#7030A0","พื้นที่โรงเรือนเลี้ยงสัตว์","A7",
                    "#F79646","พื้นที่เพาะเลี้ยงน้ำ","A8,A9",
                    "#00B050","พื้นที่ป่าไม้","F3,M1",
                    "#FF3399","พื้นที่ลุ่ม/นาเกลือ","M2,M3,M4",
                    "#FFFF00","พื้นที่ชุมชน","U1,U2",
                    "#FF0000","พื้นที่อุตสาหกรรม","U3,U5",
                    "#0070C0","พื้นที่สนามบิน/ท่าเรือ","U4",
                    "#C00000","สถานที่พักผ่อน/สนามกอล์ฟ","U6",
                    "#4BACC6","พื้นที่น้ำ","W",
                    "!","กรมพัฒนาที่ดิน",""
                });
            defSet.Add("SMPK:PLLU",
              new string[]{
                    "#FFFF00","ที่ดินประเภทที่อยู่อาศัยหนาแน่นน้อย","ย.1,ย.2,ย.3,ย.4",
                    "#FFBB02","ที่ดินประเภทที่อยู่อาศัยหนาแน่นปานกลาง","ย.5,ย.6",
                    "#A77100","ที่ดินประเภทที่อยู่อาศัยหนาแน่นมาก","ย.7,ย.8",
                    "#FC0102","ที่ดินประเภทพาณิชยกรรมและที่อยู่อาศัยหนาแน่นมาก","พ.1,พ.2,พ.3,พ.4",
                    "#7400A9","ที่ดินประเภทอุตสาหกรรมและคลังสินค้า","อ.1,อ.2",
                    "#E11FE0","ที่ดินประเภทคลังสินค้า","อ.3",
                    "PLLU1","ที่ดินประเภทอุตสาหรรมทั่วไปที่ไม่เป็นมลพิษต่อชุมชนหรือสิ่งแวดล้อมและคลังสินค้า","อ.4",
                    "#00BB00","ที่ดินประเภทชนบทและเกษตรกรรม","ก.1,ก.2",
                    "PLLU2","ที่ดินประเภทอนุรักษ์ชนบทและเกษตรกรรม","ก.3",
                    "#98E500","ที่ดินประเภทที่โล่งเพื่อนันทนาการและการรักษาคุณภาพสิ่งแวดล้อม","ล.",
                    "#5C9C00","ที่ดินประเภทสถาบันการศึกษา","ศษ.",
                    "#004AD9","ที่ดินประเภทสถาบันราชการ การสาธารณูปโภคและสาธารณูปการ","ส.",
                    "#ADC0AD","ที่ดินประเภทสถาบันศาสนา","ศน.",

                    "#FFFFFF","เขตหทาร","ท",
                    "!","อบจ. สมุทรปราการ",""
                    
                    
                });

            defSet.Add("SMPK:PLLU2544",
              new string[]{
                    "#FFFF00","ที่ดินประเภทที่อยู่อาศัยหนาแน่นน้อย","1.",
                    "#FFBB02","ที่ดินประเภทที่อยู่อาศัยหนาแน่นปานกลาง","2",
                    "#A77100","ที่ดินประเภทที่อยู่อาศัยหนาแน่นมาก","3",
                    "#FC0102","ที่ดินประเภทพาณิชยกรรมและที่อยู่อาศัยหนาแน่นมาก","4",
                    "#7400A9","ที่ดินประเภทอุตสาหกรรมและคลังสินค้า","5",
                    //"#E11FE0","ที่ดินประเภทคลังสินค้า","",
                    //"PLLU1","ที่ดินประเภทอุตสาหรรมทั่วไปที่ไม่เป็นมลพิษต่อชุมชนหรือสิ่งแวดล้อมและคลังสินค้า","",
                    "#00BB00","ที่ดินประเภทชนบทและเกษตรกรรม","6",
                    "PLLU2","ที่ดินประเภทอนุรักษ์ชนบทและเกษตรกรรม","7",
                    "#98E500","ที่ดินประเภทที่โล่งเพื่อนันทนาการและการรักษาคุณภาพสิ่งแวดล้อม","8",
                    "#5C9C00","ที่ดินประเภทสถาบันการศึกษา","9",
                    "#ADC0AD","ที่ดินประเภทสถาบันศาสนา","10",
                    "#004AD9","ที่ดินประเภทสถาบันราชการ การสาธารณูปโภคและสาธารณูปการ","11",
                    
                    "#FFFFFF","เขตหทาร","12",
                    "!","สำนักงานโยธาธิการและผังเมือง จังหวัดสมุทรปราการ",""
                    
                    
                });
            defSet.Add("SMPK:BLDG_A",
              new string[]{
                    "#FFFF00","ที่อยู่อาศัย","1",
                    "#FF0000","พาณิชยกรรม","2",
                    "#7030A0","อุตสาหกรรม","3",
                    "#F79646","ที่พักอาศัยกึ่งพาณิชยกรรม","4",
                    "#0070C0","สาธารณูปโภค","5",
                    "#BFBFBF","สาธารณูปการ","6",
                    "#00B050","โบราณสถาน/สนามกีฬา","7",
                    "#9BBB59","เรือนเพาะชำ/คอกปศุสัตว์","8",
                    "#C00000","อาคารอื่นๆ","9",
                    "!","กรมโยธาธิการและผังเมือง",""
                });


            defSet.Add("SMPK:PLRD_A",
              new string[]{
                    "#FC883A","ก (ขนาดเขตทาง 16.00 เมตร)","",
                    "#FB474B","ข (ขนาดเขตทาง 20.00 เมตร)","",
                    "#F9F442","ค (ขนาดเขตทาง 25.00 เมตร)","",
                    "#66E35E","ง (ขนาดเขตทาง 30.00 เมตร)","",
                    "#E2CCBC","จ (ขนาดเขตทาง 40.00 เมตร)","",
                    "#B024C8","ฉ (ขนาดเขตทาง 60.00 เมตร)","",
                    "!","อบจ. สมุทรปราการ",""
                });

            defSet.Add("PLRD",
              new string[]{
                    "#FC883A","ก (ขนาดเขตทาง 16.00 เมตร)","ก",
                    "#FB474B","ข (ขนาดเขตทาง 20.00 เมตร)","ข",
                    "#F9F442","ค (ขนาดเขตทาง 25.00 เมตร)","ค",
                    "#66E35E","ง (ขนาดเขตทาง 30.00 เมตร)","ง",
                    "#E2CCBC","จ (ขนาดเขตทาง 40.00 เมตร)","จ",
                    "#B024C8","ฉ (ขนาดเขตทาง 60.00 เมตร)","ฉ",
                    "#FFFF55","","",
                    "!","อบจ. สมุทรปราการ",""
                });
        }
           
        }
    }
